package kz.theeurasia.esbdproxy.domain.dict;

public enum CountryDict {

    ABW(533, "Аруба", "Aruba", 29), // Аруба
    AFG(4, "Афганистан", "Afghanistan", 30), // Афганистан
    AGO(24, "Ангола", "Angola", 23), // Ангола
    AIA(660, "Ангилья", "Anguilla", 22), // Ангилья
    ALB(8, "Албания", "Albania", 20), // Албания
    AND(20, "Андорра", "Andorra", 24), // Андорра
    ANT(530, "Нидерландские Антилы", "Netherlands Antilles", 26), // Нидерландские
								  // Антилы
    ARE(784, "Объединенные Арабские Эмираты (ОАЭ)", "United Arab Emirates", 141), // Объединенные
										  // Арабские
										  // Эмираты
										  // (ОАЭ)
    ARG(32, "Аргентина", "Argentina", 27), // Аргентина
    ARM(51, "Армения", "Armenia", 28), // Армения
    ASM(16, "Американское Самоа", "American Samoa", 75), // Американское Самоа
    ATG(28, "Антигуа и Барбуда", "Antigua and Barbuda", 25), // Антигуа и
							     // Барбуда
    AUS(36, "Австралия", "Australia", 17), // Австралия
    AUT(40, "Австрия", "Austria", 18), // Австрия
    AZE(31, "Азербайджан", "Azerbaijan", 19), // Азербайджан
    BDI(108, "Бурунди", "Burundi", 46), // Бурунди
    BEL(56, "Бельгия", "Belgium", 13), // Бельгия
    BEN(204, "Бенин", "Benin", 37), // Бенин
    BFA(854, "Буркина-Фасо", "Burkina Faso", 45), // Буркина-Фасо
    BGD(50, "Бангладеш", "Bangladesh", 32), // Бангладеш
    BGR(100, "Болгария", "Bulgaria", 42), // Болгария
    BHR(48, "Бахрейн", "Bahrain", 34), // Бахрейн
    BHS(44, "Багамы", "The Bahamas", 31), // Багамы
    BIH(70, "Босния и Герцеговина", "Bosnia and Herzegovina", 40), // Босния и
								   // Герцеговина
    BLM(652, "Сен-Бартельми", "Saint Barthélemy", -652), // Сен-Бартельми
    BLR(112, "Беларусь", "Belarus", 35), // Беларусь
    BLZ(84, "Белиз", "Belize", 36), // Белиз
    BMU(60, "Бермудские острова", "Bermuda", 38), // Бермудские острова
    BOL(68, "Боливия", "Bolivia", 43), // Боливия
    BRA(76, "Бразилия", "Brazil", 44), // Бразилия
    BRB(52, "Барбадос", "Barbados", 33), // Барбадос
    BRN(96, "Бруней-Даруссалам", "Brunei", -96), // Бруней-Даруссалам
    BTN(64, "Бутан", "Bhutan", 47), // Бутан
    BWA(72, "Ботсвана", "Botswana", 41), // Ботсвана
    CAF(140, "Центральноафриканская Республика (ЦАР)", "Central African Republic", 194), // Центральноафриканская
											 // Республика
											 // (ЦАР)
    CAN(124, "Канада", "Canada", 90), // Канада
    CCK(166, "Кокосовые (Килинг) острова", "Cocos (Keeling) Islands", -166), // Кокосовые
									     // (Килинг)
									     // острова
    CHE(756, "Швейцария", "Switzerland", 8), // Швейцария
    CHL(152, "Чили", "Chile", 197), // Чили
    CHN(156, "Китай (КНР)", "China", 95), // Китай (КНР)
    CIV(384, "Кот д’Ивуар", "Cote d’Ivoire", 102), // Кот д’Ивуар
    CMR(120, "Камерун", "Cameroon", 89), // Камерун
    COD(180, "Демократическая Республика Конго", "Democratic Republic of the Congo", -180), // Демократическая
											    // Республика
											    // Конго
    COG(178, "Конго", "Republic of the Congo", 99), // Конго
    COK(184, "Острова Кука", "Cook Islands", 105), // Острова Кука
    COL(170, "Колумбия", "Colombia", 97), // Колумбия
    COM(174, "Коморы", "Comoros", 98), // Коморы
    CPV(132, "Кабо-Верде", "Cape Verde", 86), // Кабо-Верде
    CRI(188, "Коста-Рика", "Costa Rica", 101), // Коста-Рика
    CUB(192, "Куба", "Cuba", 103), // Куба
    CXR(162, "Остров Рождества", "Christmas Island", -162), // Остров Рождества
    CYM(136, "Каймановы острова", "Cayman Islands", 87), // Каймановы острова
    CYP(196, "Кипр", "Cyprus", 93), // Кипр
    CZE(203, "Чешская Республика", "Czech Republic", 196), // Чешская Республика
    DEU(276, "Германия", "Germany", 5), // Германия
    DJI(262, "Джибути", "Djibouti", 71), // Джибути
    DMA(212, "Доминика", "Dominica", 72), // Доминика
    DNK(208, "Дания", "Denmark", 70), // Дания
    DOM(214, "Доминиканская Республика", "Dominican Republic", 73), // Доминиканская
								    // Республика
    DZA(12, "Алжир", "Algeria", 21), // Алжир
    ECU(218, "Эквадор", "Ecuador", 201), // Эквадор
    EGY(818, "Египет", "Egypt", 10), // Египет
    ERI(232, "Эритрея", "Eritrea", 203), // Эритрея
    ESP(724, "Испания", "Spain", 84), // Испания
    EST(233, "Эстония", "Estonia", 200), // Эстония
    ETH(231, "Эфиопия", "Ethiopia", 204), // Эфиопия
    FIN(246, "Финляндия", "Finland", 192), // Финляндия
    FJI(242, "Фиджи", "Fiji", 190), // Фиджи
    FLK(238, "Фолклендские (Мальвинские) острова", "Falkland Islands (Islas Malvinas)", -238), // Фолклендские
											       // (Мальвинские)
											       // острова
    FRA(250, "Франция", "France", 12), // Франция
    FRO(234, "Фарерские острова", "Faroe Islands", 189), // Фарерские острова
    FSM(583, "Микронезия", "Micronesia, Federated States of", 124), // Микронезия
    GAB(266, "Габон", "Gabon", 55), // Габон
    GBR(826, "Великобритания", "United Kingdom", 7, 209), // Великобритания
    GEO(268, "Грузия", "Georgia", 68), // Грузия
    GGY(831, "Гернси", "Guernsey", -831), // Гернси
    GHA(288, "Гана", "Ghana", 59), // Гана
    GIB(292, "Гибралтар", "Gibraltar", 63), // Гибралтар
    GIN(324, "Гвинея", "Guinea", 61), // Гвинея
    GLP(312, "Гваделупа", "Guadeloupe", -312), // Гваделупа
    GMB(270, "Гамбия", "The Gambia", 58), // Гамбия
    GNB(624, "Гвинея-Бисау", "Guinea-Bissau", 62), // Гвинея-Бисау
    GNQ(226, "Экваториальная Гвинея", "Equatorial Guinea", 202), // Экваториальная
								 // Гвинея
    GRC(300, "Греция", "Greece", 67), // Греция
    GRD(308, "Гренада", "Grenada", 65), // Гренада
    GRL(304, "Гренландия", "Greenland", 66), // Гренландия
    GTM(320, "Гватемала", "Guatemala", 60), // Гватемала
    GUF(254, "Французская Гвиана", "French Guiana", -254), // Французская Гвиана
    GUM(316, "Гуам", "Guam", 69), // Гуам
    GUY(328, "Гайана", "Guyana", 57), // Гайана
    HKG(344, "Гонконг", "Hong Kong", -344), // Гонконг
    HND(340, "Гондурас", "Honduras", 64), // Гондурас
    HRV(191, "Хорватия", "Croatia", 193), // Хорватия
    HTI(332, "Гаити", "Haiti", 56), // Гаити
    HUN(348, "Венгрия", "Hungary", 49), // Венгрия
    IDN(360, "Индонезия", "Indonesia", 79), // Индонезия
    IMN(833, "Остров Мэн", "Isle of Man", 4), // Остров Мэн
    IND(356, "Индия", "India", 78), // Индия
    IOT(86, "Британская территория в Индийском океане", "British Indian Ocean Territory", -86), // Британская
												// территория
												// в
												// Индийском
												// океане
    IRL(372, "Ирландия", "Ireland", 11), // Ирландия
    IRN(364, "Иран", "Iran", 82), // Иран
    IRQ(368, "Ирак", "Iraq", 81), // Ирак
    ISL(352, "Исландия", "Iceland", 83), // Исландия
    ISR(376, "Израиль", "Israel", 77), // Израиль
    ITA(380, "Италия", "Italy", 14), // Италия
    JAM(388, "Ямайка", "Jamaica", 207), // Ямайка
    JEY(832, "Джерси", "Jersey", -832), // Джерси
    JOR(400, "Иордания", "Jordan", 80), // Иордания
    JPN(392, "Япония", "Japan", 16), // Япония
    KAZ(398, "Казахстан", "Kazakhstan", 1), // Казахстан
    KEN(404, "Кения", "Kenya", 92), // Кения
    KGZ(417, "Киргизия", "Kyrgyzstan", 9), // Киргизия
    KHM(116, "Камбоджа", "Cambodia", 88), // Камбоджа
    KIR(296, "Кирибати", "Kiribati", 94), // Кирибати
    KNA(659, "Сент-Китс и Невис", "Saint Kitts and Nevis", 164), // Сент-Китс и
								 // Невис
    KOR(410, "Южная Корея", "Korea, South", 96), // Южная Корея
    KWT(414, "Кувейт", "Kuwait", 104), // Кувейт
    LAO(418, "Лаос", "Laos", 106), // Лаос
    LBN(422, "Ливан", "Lebanon", 110), // Ливан
    LBR(430, "Либерия", "Liberia", 111), // Либерия
    LBY(434, "Ливия", "Libya", 109), // Ливия
    LCA(662, "Сент-Люсия", "Saint Lucia", 165), // Сент-Люсия
    LIE(438, "Лихтенштейн", "Liechtenstein", 113), // Лихтенштейн
    LKA(144, "Шри-Ланка", "Sri Lanka", 199), // Шри-Ланка
    LSO(426, "Лесото", "Lesotho", 108), // Лесото
    LTU(440, "Литва", "Lithuania", 112), // Литва
    LUX(442, "Люксембург", "Luxembourg", 213), // Люксембург
    LVA(428, "Латвия", "Latvia", 107), // Латвия
    MAC(446, "Макао", "Macau", -446), // Макао
    MAF(663, "Остров Святого Мартина", "Saint Martin", 214), // Остров Святого
							     // Мартина
    MAR(504, "Марокко", "Morocco", 130), // Марокко
    MCO(492, "Монако", "Monaco", 127), // Монако
    MDA(498, "Молдова", "Moldova", 126), // Молдова
    MDG(450, "Мадагаскар", "Madagascar", 115), // Мадагаскар
    MDV(462, "Мальдивы", "Maldives", -462), // Мальдивы
    MEX(484, "Мексика", "Mexico", 123), // Мексика
    MHL(584, "Маршалловы острова", "Marshall Islands", 122), // Маршалловы
							     // острова
    MKD(807, "Республика Македония", "Macedonia", 116), // Республика Македония
    MLI(466, "Мали", "Mali", 120), // Мали
    MLT(470, "Мальта", "Malta", 119), // Мальта
    MMR(104, "Мьянма", "Burma", 39, 131), // Мьянма
    MNE(499, "Черногория", "Montenegro", 212), // Черногория
    MNG(496, "Монголия", "Mongolia", 128), // Монголия
    MNP(580, "Северные Марианские острова", "Northern Mariana Islands", 121), // Северные
									      // Марианские
									      // острова
    MOZ(508, "Мозамбик", "Mozambique", 125), // Мозамбик
    MRT(478, "Мавритания", "Mauritania", -478), // Мавритания
    MSR(500, "Монтсеррат", "Montserrat", 129), // Монтсеррат
    MUS(480, "Маврикий", "Mauritius", 114), // Маврикий
    MWI(454, "Малави", "Malawi", 117), // Малави
    MYS(458, "Малайзия", "Malaysia", 118), // Малайзия
    MYT(175, "Майотта", "Mayotte", -175), // Майотта
    NAM(516, "Намибия", "Namibia", 132), // Намибия
    NCL(540, "Новая Каледония", "New Caledonia", -540), // Новая Каледония
    NER(562, "Нигер", "Niger", 135), // Нигер
    NFK(574, "Остров Норфолк", "Norfolk Island", -574), // Остров Норфолк
    NGA(566, "Нигерия", "Nigeria", 136), // Нигерия
    NIC(558, "Никарагуа", "Nicaragua", 140), // Никарагуа
    NIU(570, "Ниуэ", "Niue", -570), // Ниуэ
    NLD(528, "Нидерланды", "Netherlands", 139), // Нидерланды
    NOR(578, "Норвегия", "Norway", 138), // Норвегия
    NPL(524, "Непал", "Nepal", 134), // Непал
    NRU(520, "Науру", "Nauru", 133), // Науру
    NZL(554, "Новая Зеландия", "New Zealand", 137), // Новая Зеландия
    OMN(512, "Оман", "Oman", 142), // Оман
    PAK(586, "Пакистан", "Pakistan", 143), // Пакистан
    PAN(591, "Панама", "Panama", 145, 146), // Панама
    PCN(612, "Питкерн", "Pitcairn", -612), // Питкерн
    PER(604, "Перу", "Peru", 150), // Перу
    PHL(608, "Филиппины", "Philippines", 191), // Филиппины
    PLW(585, "Палау", "Palau", 144), // Палау
    PNG(598, "Папуа-Новая Гвинея", "Papua New Guinea", 147, 148), // Папуа-Новая
								  // Гвинея
    POL(616, "Польша", "Poland", 152), // Польша
    PRI(630, "Пуэрто-Рико", "Puerto Rico", -630), // Пуэрто-Рико
    PRK(408, "Северная Корея (КНДР)", "Korea, North", 100), // Северная Корея
							    // (КНДР)
    PRT(620, "Португалия", "Portugal", 153), // Португалия
    PRY(600, "Парагвай", "Paraguay", 149), // Парагвай
    PSE(275, "Оккупированная палестинская территория", "Palestinian Territory, Occupied", 211), // Оккупированная
												// палестинская
												// территория
    PYF(258, "Французская Полинезия", "French Polynesia", 151), // Французская
								// Полинезия
    QAT(634, "Катар", "Qatar", 91), // Катар
    REU(638, "Реюньон", "Reunion", -638), // Реюньон
    ROU(642, "Румыния", "Romania", 155), // Румыния
    RUS(643, "Россия (РФ)", "Russia", 2), // Россия (РФ)
    RWA(646, "Руанда", "Rwanda", 154), // Руанда
    SAU(682, "Саудовская Аравия", "Saudi Arabia", 159), // Саудовская Аравия
    SDN(736, "Судан", "Sudan", 172), // Судан
    SEN(686, "Сенегал", "Senegal", 163), // Сенегал
    SGP(702, "Сингапур", "Singapore", 166), // Сингапур
    SGS(239, "Южная Джорджия и Южные Сандвичевы острова", "South Georgia and the South Sandwich Islands", -239), // Южная
														 // Джорджия
														 // и
														 // Южные
														 // Сандвичевы
														 // острова
    SHG_(-1, "SCHENGENER STAATEN", "SCHENGENER STAATEN", 208), // SCHENGENER
							       // STAATEN
    SHN(654, "Святая Елена", "Saint Helena", -654), // Святая Елена
    SJM(744, "Шпицберген и Ян Майен", "Svalbard and Jan Mayen", -744), // Шпицберген
								       // и Ян
								       // Майен
    SLB(90, "Соломоновы острова", "Solomon Islands", 170), // Соломоновы острова
    SLE(694, "Сьерра-Леоне", "Sierra Leone", 174), // Сьерра-Леоне
    SLV(222, "Эль-Сальвадор", "El Salvador", 156), // Эль-Сальвадор
    SMR(674, "Сан-Марино", "San Marino", 157), // Сан-Марино
    SOM(706, "Сомали", "Somalia", 171), // Сомали
    SPM(666, "Сен-Пьер и Микелон", "Saint Pierre and Miquelon", 161), // Сен-Пьер
								      // и
								      // Микелон
    SRB(688, "Сербия", "Serbia", 210), // Сербия
    STP(678, "Сан-Томе и Принсипи", "Sao Tome and Principe", 158), // Сан-Томе и
								   // Принсипи
    SUR(740, "Суринам", "Suriname", 173), // Суринам
    SVK(703, "Словакия", "Slovakia", 168), // Словакия
    SVN(705, "Словения", "Slovenia", 169), // Словения
    SWE(752, "Швеция", "Sweden", 198), // Швеция
    SWZ(748, "Свазиленд", "Swaziland", 160), // Свазиленд
    SYC(690, "Сейшелы", "Seychelles", 162), // Сейшелы
    SYR(760, "Сирия", "Syria", 167), // Сирия
    TCA(796, "Острова Тёркс и Кайкос", "Turks and Caicos Islands", -796), // Острова
									  // Тёркс
									  // и
									  // Кайкос
    TCD(148, "Чад", "Chad", 195), // Чад
    TGO(768, "Того", "Togo", 181), // Того
    THA(764, "Таиланд", "Thailand", 177), // Таиланд
    TJK(762, "Таджикистан", "Tajikistan", 175), // Таджикистан
    TKM(795, "Туркмения", "Turkmenistan", 183), // Туркмения
    TLS(626, "Тимор-Лесте", "Timor-Leste", -626), // Тимор-Лесте
    TON(776, "Тонга", "Tonga", 180), // Тонга
    TTO(780, "Тринидад и Тобаго", "Trinidad and Tobago", 179), // Тринидад и
							       // Тобаго
    TUN(788, "Тунис", "Tunisia", 15), // Тунис
    TUR(792, "Турция", "Turkey", 3), // Турция
    TUV(798, "Тувалу", "Tuvalu", 182), // Тувалу
    TWN(158, "Тайвань (Китай)", "Taiwan", 176), // Тайвань (Китай)
    TZA(834, "Танзания", "Tanzania", 178), // Танзания
    UGA(800, "Уганда", "Uganda", 184), // Уганда
    UKR(804, "Украина", "Ukraine", 185), // Украина
    URY(858, "Уругвай", "Uruguay", 188), // Уругвай
    USA(840, "Соединенные Штаты Америки (США)", "United States", 6), // Соединенные
								     // Штаты
								     // Америки
								     // (США)
    UZB(860, "Узбекистан", "Uzbekistan", 186), // Узбекистан
    VAT(336, "Ватикан", "Holy See (Vatican City)", 48), // Ватикан
    VCT(670, "Сент-Винсент и Гренадины", "Saint Vincent and the Grenadines", -670), // Сент-Винсент
										    // и
										    // Гренадины
    VEN(862, "Венесуэла", "Venezuela", 50), // Венесуэла
    VGB(92, "Британские Виргинские острова", "British Virgin Islands", 51), // Британские
									    // Виргинские
									    // острова
    VIR(850, "Виргинские острова США", "Virgin Islands", 52), // Виргинские
							      // острова США
    VNM(704, "Вьетнам", "Vietnam", 54), // Вьетнам
    VUT(548, "Вануату", "Vanuatu", -548), // Вануату
    WLF(876, "Уоллис и Футуна", "Wallis and Futuna", 187), // Уоллис и Футуна
    WSM(882, "Самоа", "Samoa", 53), // Самоа
    YEM(887, "Йемен", "Yemen", 85), // Йемен
    YUG(891, "Югославия", "Югославия", 205), // Югославия
    ZAF(710, "Южная Африка (ЮАР)", "South Africa", 206), // Южная Африка (ЮАР)
    ZMB(894, "Замбия", "Zambia", 74), // Замбия
    ZWE(716, "Зимбабве", "Zimbabwe", 76), // Зимбабве
    UNSPECIFIED(0, "", "", 0);

    private final long[] ids;
    private final int isoCode;
    private final String rusname;
    private final String engname;

    CountryDict(int isoCode, String rusname, String engname, long... ids) {
	this.isoCode = isoCode;
	this.rusname = rusname;
	this.engname = engname;
	this.ids = ids;
    }

    public long getId() {
	if (ids.length > 0)
	    return ids[0];
	else
	    return -1;
    }

    public static CountryDict forISOCode(int isoCode) {
	for (CountryDict c : CountryDict.values())
	    if (c.getIsoCode() == isoCode)
		return c;
	return null;
    }

    public static CountryDict forISOCode(String isoCode) {
	try {
	    int i = Integer.parseInt(isoCode);
	    return forISOCode(i);
	} catch (NumberFormatException e) {
	    return null;
	}
    }

    public static CountryDict forId(long id) {
	for (CountryDict c : CountryDict.values())
	    for (long i : c.getIds())
		if (id == i)
		    return c;
	return null;
    }

    // GENERATED

    public long[] getIds() {
	return ids;
    }

    public int getIsoCode() {
	return isoCode;
    }

    public String getRusname() {
	return rusname;
    }

    public String getEngname() {
	return engname;
    }

}
