package kz.theeurasia.services.domain.global;

/**
 * Регионы Казахстана
 * 
 * @author vadim.isaev
 *
 */
public enum CountryRegion {
    GAST, // Астана - код 01
    GALM, // Алматы - код 02
    OAKM, // Акмолинская область - код 03
    OAKT, // Актюбинская область - код 04
    OALM, // Алматинская область - код 05
    OATY, // Атырауская область - код 06
    OZK, // Западно-Казахстанская область - код 07
    OZHM, // Жамбылская область - код 08
    OKGD, // Карагандинская область - код 09
    OKST, // Костанайская область - код 10
    OKZL, // Кызылординская область - код 11
    OMNG, // Мангистауская область - код 12
    OUK, // Южно-Казахстанская область - код 13
    OPVL, // Павлодарская область - код 14
    OSK, // Северо-Казахстанская область - код 15
    OVK; // Восточно-Казахстанская область - код 16
}
